# Project: Reviewing Google Analytics data for search terms associated with Sky Piracy.

### Objective of this document: To clean the data downloaded form Google Analytics, so that analysis can be made without any issues or misrepresentations when coming to conclusions from the data.

##### Below is the code used to import my CSV files that I downloaded from Google Analytics. I used some general search terms to identify some trend history of pirating sky sports to keep the project simple. These terms are "free online sky", "free sky", "free sky sports", "sky sports free", "watch sky sports free". 

##### Each data set is stored into its own variable based on the name / search term of the csv.

In [47]:
import pandas as pd
free_online_sky = pd.read_csv("/home/ollydb20/Data Analysis/Sky Piracy Data/Raw Data/FreeOnlineSky.csv")
free_sky = pd.read_csv("/home/ollydb20/Data Analysis/Sky Piracy Data/Raw Data/FreeSky.csv")
free_sky_sports = pd.read_csv("/home/ollydb20/Data Analysis/Sky Piracy Data/Raw Data/FreeSkySports.csv")
sky_sports_free = pd.read_csv("/home/ollydb20/Data Analysis/Sky Piracy Data/Raw Data/SkySportsFree.csv")
watch_sky_sports_free = pd.read_csv("/home/ollydb20/Data Analysis/Sky Piracy Data/Raw Data/WatchSkySportsFree.csv")

##### The below method is simply to inspect the first 5 lines of two sepreate datasets (to ensure that the data has is consistent from Google Analytics)

In [48]:
free_online_sky.head(5)

  Category: All categories                         Unnamed: 1
0                      NaN                                NaN
1                    Month  free online sky: (United Kingdom)
2                  2004-01                                  0
3                  2004-02                                  0
4                  2004-03                                  0

In [49]:
free_sky.head(5)

  Category: All categories                  Unnamed: 1
0                      NaN                         NaN
1                    Month  free sky: (United Kingdom)
2                  2004-01                          30
3                  2004-02                          28
4                  2004-03                          23

##### From the outset, it is clear that the datasets have included the first 2 lines (row 0-1 wihtin the data itself. This would likely cause issues with the insights and analysis and would need to be removed).

##### The following code is to demonstrate how to remove the duplicate rows in Python, but I would normally re-import the file with "pd.read_csv = ('filename', skiprows = 2)" command.

##### Instead the command is to use the method "iloc" which essentially just finds the row index (identifier) and The "reset_index" method is prevent the dataframe from being altered into a series object(which looks a lot messier). The parameter "drop = True" drops the initial index so they are not duplicated

In [50]:
free_online_sky = free_online_sky.iloc[2:].reset_index(drop=True)
free_sky = free_sky.iloc[2:].reset_index(drop=True)
free_sky_sports = free_sky_sports.iloc[2:].reset_index(drop=True)
sky_sports_free = sky_sports_free.iloc[2:].reset_index(drop = True)
watch_sky_sports_free = watch_sky_sports_free.iloc[2:].reset_index(drop = True)

##### Now simply to test whether the code above worked by inspecting the data again ....

In [51]:
free_online_sky.head(5)

  Category: All categories Unnamed: 1
0                  2004-01          0
1                  2004-02          0
2                  2004-03          0
3                  2004-04          0
4                  2004-05          0

In [52]:
free_sky.head(5)

  Category: All categories Unnamed: 1
0                  2004-01         30
1                  2004-02         28
2                  2004-03         23
3                  2004-04         25
4                  2004-05         23

##### The next issue identified with this data is now the columns do not have any titles. The below code is to rename the categories with titles more appropriate for the data it is holding.

In [53]:
free_online_sky = free_online_sky.rename(columns = {'Category: All categories' : 'Month', 
                                           'Unnamed: 1' : 'Searches for \'Free Online Sky\''

})

free_online_sky.head(2)

     Month Searches for 'Free Online Sky'
0  2004-01                              0
1  2004-02                              0

##### As above, this is much clearer and the same logic can be applied to all data sets (below)

In [54]:
free_sky = free_sky.rename(columns = {'Category: All categories' : 'Month', 
                                           'Unnamed: 1' : 'Searches for \'Free Sky\''})
free_sky_sports = free_sky_sports.rename(columns = {'Category: All categories' : 'Month', 
                                           'Unnamed: 1' : 'Searches for \'Free Sky Sports\''})
sky_sports_free = sky_sports_free.rename(columns = {'Category: All categories' : 'Month', 
                                           'Unnamed: 1' : 'Searches for \'Sky Sports Free\''})
watch_sky_sports_free = watch_sky_sports_free.rename(columns = {'Category: All categories' : 'Month', 
                                           'Unnamed: 1' : 'Searches for \'Watch Sky Sports Free\''})

##### The final step before Analysis is to merge the datasets into one for easier analysis. Using the merge method, this is quite simple. For this data, I would use an outer merge to get all of the data. More complex data (missing values / different columns would require more advanced tools).

##### As I've learned a lot of software development (Java/Python) in my spare time, I know some tricks e.g. lambda function. All the below commands are saying is to create a list (groups variables together ie. the datasets) and merge using the variables using an outer merge.

In [55]:
from functools import reduce

dfs = [free_sky, free_sky_sports, sky_sports_free, watch_sky_sports_free]
merged_data = reduce(lambda left, right: pd.merge(left, right, how='outer'), dfs)

##### The below code is to inspect our new dataset, with the variable "merged_data", to ensure it looks like what we had initially wanted.

In [56]:
merged_data.head()

,Month,Searches for 'Free Sky',Searches for 'Free Sky Sports',Searches for 'Sky Sports Free',Searches for 'Watch Sky Sports Free'
0,2004-01,30,5,5,0
1,2004-02,28,9,9,0
2,2004-03,23,0,0,0
3,2004-04,25,0,0,0
4,2004-05,23,5,5,0

##### The data looks good and is ready for analysis (in a seperate document). Using the "to_csv" command, python can save the new dataset to a new CSV file in the relevant folder.

In [57]:
merged_data.to_csv("/home/ollydb20/Data Analysis/Sky Piracy Data/Cleaned Data/cleaned_data.csv")